---
type: ReloadSwapOutInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ReloadSwapOutInfo

`Autodesk.Revit.DB.ReloadSwapOutInfo` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CurrentVersion | 2019 | `public int CurrentVersion { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Part | 2019 | `public ElementId Part { get ; }` |
| Property | PreviousVersion | 2019 | `public int PreviousVersion { get ; }` |
| Property | WasSwapped | 2019 | `public bool WasSwapped { get ; }` |